Revit 2027 API
SymbolicCurve.IsDrawnInForeground Property
Indicates if this curve will be drawn in the foreground of the family instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsDrawnInForeground { get; set; }
Public Property IsDrawnInForeground As Boolean
	Get
	Set
public:
property bool IsDrawnInForeground {
	bool get ();
	void set (bool value);
}
member IsDrawnInForeground : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when regeneration failed. Thrown when the value for this property cannot be changed.
See Also
Reference
SymbolicCurve Class
Autodesk.Revit.DB Namespace